app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_param)
        if @cat.save!
---
INSERT INTO "cats" ("birth_date", "created_at", "updated_at", "color", "name", "sex", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        @cat = Cat.find(params[:id])
        if @cat.update!(cat_param)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "color" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["birth_date", "2021-04-25"], ["color", "Black"], ["description", "best cat ever"], ["updated_at", "2021-05-27 21:21:50.667347"], ["id", 3]]